In [1]:
import pandas as pd

In [2]:
# 1. Converting strings to datetime
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
              'value': [2,3,4]}
             )
df

        date  value
0  3/10/2000      2
1  3/11/2000      3
2  3/12/2000      4

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [4]:
pd.to_datetime(df['date'], format='%m/%d/%Y') 
# '3/11/2000' the format should match: ex format='%m/%d/%Y'
# BUT you can change place of %d %m
# Check documentation for proper formatting

0   2000-03-10
1   2000-03-11
2   2000-03-12
Name: date, dtype: datetime64[ns]

In [5]:
pd.to_datetime(df['date'], format='%d/%m/%Y')

0   2000-10-03
1   2000-11-03
2   2000-12-03
Name: date, dtype: datetime64[ns]

In [6]:
df = pd.DataFrame({'date': ['2016-6-10 20:30:0',
                            '2016-7-1 19:45:30',
                            '2013-10-12 4:5:1'],
                    'value': [2, 3, 4]})
df

                date  value
0  2016-6-10 20:30:0      2
1  2016-7-1 19:45:30      3
2   2013-10-12 4:5:1      4

In [7]:
pd.to_datetime(df['date'], format='%Y-%m-%d %H:%M:%S')

0   2016-06-10 20:30:00
1   2016-07-01 19:45:30
2   2013-10-12 04:05:01
Name: date, dtype: datetime64[ns]

In [8]:
# cleaning garbage value
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
              'value': [2,3,4]}
             )
df

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [9]:
pd.to_datetime(df['date'], errors='ignore')

0    3/10/2000
1    a/11/2000
2    3/12/2000
Name: date, dtype: object

In [10]:
pd.to_datetime(df['date'], errors='coerce') # Nat: Not a Time

0   2000-03-10
1          NaT
2   2000-03-12
Name: date, dtype: datetime64[ns]

In [11]:
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
              'value': [2, 3, 4]}
             )
df

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [12]:
df = pd.DataFrame({'year': ['2015', '2016'],
                   'month': ['2','3'],
                   'day': ['4','5'],
                   'name': ['ratan', 'durga']})
df

   year month day   name
0  2015     2   4  ratan
1  2016     3   5  durga

In [13]:
df['date'] = df[['year', 'month', 'day']].apply('-'.join, axis=1)
df

   year month day   name      date
0  2015     2   4  ratan  2015-2-4
1  2016     3   5  durga  2016-3-5

In [14]:
df['date2'] = df[['year', 'month', 'day']].apply(lambda x:'-'.join(x), axis=1)
df

   year month day   name      date     date2
0  2015     2   4  ratan  2015-2-4  2015-2-4
1  2016     3   5  durga  2016-3-5  2016-3-5

In [15]:
pd.to_datetime(df['date'])

0   2015-02-04
1   2016-03-05
Name: date, dtype: datetime64[ns]

In [18]:
pd.to_datetime(df['date2'])

0   2015-02-04
1   2016-03-05
Name: date2, dtype: datetime64[ns]